[
    "RICE:\n● For irrigation information: It's not always necessary to keep standing water in the rice field. Use water in such a way that it neither stands all the time nor lets the soil dry out. Keeping the soil moist is essential. After transferring the nursery, keep about 4cm of water standing in the field for 15 to 20 days. After that, it's not necessary to keep water standing. Stop irrigation 15 days before the harvest so that the field isn't waterlogged nor too muddy during harvesting. For 'watr' (dry cultivation), water conservation is significant. This also helps prevent white grubs. Constant waterlogging increases white grub infestation.\n● For regional seed varieties: Nursery varieties in Punjab include dry Basmati 2000, 365, and 360; Chana or Shai Aari, Nayab Chel, IRRI9 KS 2R2, KS 133, standard seeds 5 to 7 kg. Nursery planting time: June 1 to 30, May 20 to June 7.\n● Varieties for southern Punjab: Basmati 198, Chana KSK 2R2, KSA 33. Standard seed amount 5 to 7 kg. Nursery planting time: June 1 to 15, May 20 to June 7.\n● For harvesting information: Timely harvesting is crucial for good rice yield. Drain water from the field two weeks before harvesting. At the time of harvesting, the moisture content should be about 22%. The crop is ready for harvesting when it turns golden. Delay in harvesting can cause grains to drop. Dry the harvested crop in the sun for 1 to 2 days to dry the plants. Do the threshing 2-3 days after harvesting. Remember to cut the crop level to the ground to avoid leaving stubble. Clean all storerooms before storing rice. Before storage, ensure the moisture content in rice is around 12 to 13%.\nFor pests, diseases, and their management: Rice in Pakistan is susceptible to many diseases. Important diseases and their prevention are listed below:\n● Foot rot: In this disease, the plant becomes longer, thinner, and yellower than healthy plants. Brown spots appear on the stem. Severely affected plants dry up from the bottom up and die. The stem burns from the bottom, and roots start emerging from the affected parts. White or pinkish-white fungal growths, containing disease spores, appear on the plant. These spores infect other plants, potentially contaminating the entire field and causing diseases to spread in the following year. Therefore, do not use seeds from an affected crop. To prevent this, do not cultivate Basmati in fields where the disease was present last year and do not use seeds from such fields. Use healthy, disease-free seeds and burn affected plants. In diseased fields, use resistant varieties like KSK 2 8 2, KSK33, Nayab, and IRRI9.\n● Bacterial blight: This disease usually appears when the ear shoots emerge. Affected plants don't grow properly, and grains don't form well, breaking during milking. The disease starts from the tips and edges of the leaves and spreads in length and width. The affected part appears elongated and later dries and turns white. A moist streak runs from the leaf's tips and edges downwards. The disease can be controlled through several measures:\n● For example, proper use of fertilizers, uprooting diseased plants and their neighbors, and preventing water from diseased fields entering other fields. Treatments such as chloride, cuprite, or conic at 3gm per liter of water, sprayed every 10 days, can be effective.\n● Brown leaf spot and brown blotch diseases: These diseases occur in fields with a potassium deficiency. They attack leaves and grains. Small marks appear on the leaves with brown edges. In severe cases, the number of spots increases significantly. The grains show circular or elongated ink-colored marks. If the nursery is attacked, it appears burnt from a distance. The control of brown leaf scorch involves preventive measures. Use disease-free seeds. Along with nitrogen and phosphorous fertilizers, potassium should also be used.\n● STEM ROT: This disease's symptoms appear after ear emergence. The disease's slimy spores stick to the stem's surface and leave ink-like brown marks, which then attack the stem, causing both the base and the stem to rot. In severe cases, grains do not form and appear white. To control stem rot, burn rice stubble. Do not let water stand in the field for more than 1% of the time. Prevent water from infected fields from entering other fields. Add water to the field up to about 50 days after transplanting.\n● DISEASE MANAGEMENT: Appropriate treatments have been suggested for each disease. Additionally, for fungal diseases like smut and rice blast, treat seeds",
    "CHICKPEA\nFor Irrigation Information:\nChickpea cultivation is mostly done in rainfed areas, and usually, the water requirement is met by seasonal rainfall. In case of less rainfall, where irrigation facilities are available, it is advisable to water the crop once during flowering, which helps in developing healthy and larger grains and increases yield.\n\nFor Regional Seed Varieties:\n\n    Regions: Chakwal, Attock, Jhelum, Rawalpindi.\n        Suitable varieties: Darsh, Parbat, BarKask Nahr, Battil98, Balksar 2000, Balksar 2001, Feem98, Nisa88.\n        Planting time: 15th Oct to 15th Nov.\n        Seed rate per acre: 25 to 30kg.\n\n    Region: Bhakkar, Khushab, Jhang, Mianwali, Layyah.\n        Seasonal varieties: Punjab91, Battil98, Bhakkar2011, Phal 2005, Feem98, Punjab Channa 2000, Bhakhr2016.\n        Planting time: 15th Oct to 15th Nov.\n        Seed rate per acre: 25 to 30kg.\n\n    Regions: Dera Ismail Khan, Karak, Bannu, Lakki Marwat.\n        Suitable varieties: Feem98, Nisa88, Batal98, Lawagar 2000, Nifa 2005, Shingarh 2000, Kart 1 to 2, Punjab Channa 2000.\n        Planting time: 10th Oct to 31st Oct.\n        Seed rate per acre: 25 to 30kg.\n\n    Regions: Sargodha, Lahore, Sahiwal, Faisalabad.\n        Suitable varieties: Battil98, Punjab 91, Noor 91, Feem 2000, Noor 2009, Punjab Channa 2000, Feem98, Punjab 20008.\n        Planting time: 15th Oct to 15th Nov.\n        Seed rate per acre: 25 to 30 kg.\n\n    Regions: Bahawalnagar, Bahawalpur, Rahim Yar Khan, Muzaffargarh.\n        Suitable varieties: Fee44, Punjab 91, Battil98, Feem98, Punjab 2008, Rachna.\n        Planting time: 1st Oct to 31st Oct.\n        Seed rate per acre: 25 to 30kg.\n\n    Regions: Chakwal, Sukkur, Larkana, Shikarpur, Dadu, Nawabshah, Naseerabad.\n        Suitable varieties: BG92, BG89, CM2000, CM20008.\n        Planting time: 15th Oct to 15th Nov.\n        Seed rate per acre: 25 to 30 kg.\n\nFor Harvesting Information:\n\n    Chickpea crops require careful handling during harvesting as the grains start to shed under intense sun if the crop is too dry. Some varieties are more prone to shedding than others, so care must be taken. The best time for harvesting is in the morning when dew is present on the crop, which minimizes the risk of grain and pod shedding. After harvesting, gather the crop into small heaps and let it dry in the sun for a few days before threshing. A thresher can be used for threshing. Clean the grains thoroughly and dry them in the sun before storing them in sacks.\n\nFor Pest, Disease Management, and Control:\n\n    Chickpea crops are attacked by various diseases, including wilt, dry root rot, and dry stem rot. These diseases significantly affect the crop. The following recommendations can be followed for prevention:\n        Cultivate disease-resistant varieties.\n        Treat seeds with systemic fungicides like Bladex, Toxin, Tato, or similar products at a rate of 2 to 3 grams per kg of seed.\n        Use healthy seeds from disease-free areas.\n        Bury crop residues in the soil using a deep plow.\n        In irrigated areas where drought is an issue, disease can be prevented in the subsequent crop.\n        Avoid cultivating in a field that had a disease outbreak for at least 3 years.\n        Ensure proper drainage in the field. The crop is susceptible to pests like cutworms, tobacco caterpillar, and stem borers, with stem borers being the most dangerous. In Punjab's upper regions, borer attacks occur in Nov-Dec and another wave in the first to the third week of March, resulting in up to 50% damage. In Rajasthan areas of Punjab, significant cultivation areas, the borer attack",
    "WHEAT\nFor Irrigation Information:\n● Wheat crop should be watered three times after sowing. The first watering should be done 12 to 19 days after emergence. In areas previously cultivated with rice, the first watering should be 30 to 40 days after emergence. The second watering should be done 80 to 90 days after sowing when the earing stage begins. The third watering should be given during grain formation. If the weather is dry and water is available, an additional watering may be necessary.\n\nFor Regional Seed Varieties:\nTo achieve high yields of wheat, the seed should be clean, pure, free from diseases and pests. Recommended treatments should be applied to the seed before sowing. For optimal yields, sow 50 to 60kg of seed per acre.\n\nIn the Irrigated and Rainfed areas of Punjab:\nIrrigated Areas:\n● Recommended varieties for Punjab's irrigated areas include Galaxy2013, Punjab 2011, Aari 2011, Aas 2011, NARC 2009, NARC 2011, Faisalabad 2008.\nRainfed Areas:\n● Margalla 1999, Muafas 2001, GA2002, Chakwal 1997, Uqab 2000, Chakwal 50, Benrabi 2011.\n\nIn Sindh:\n● Anmol 91, TJ82, Aabdar 92, Sindh81, Maarvi 2000, Nomaal 2002, Bhatai TD1.\n\nIn Khyber Pakhtunkhwa:\n● Recommended varieties for irrigated areas include Peersapa 2008, Peerbagh 2013, Hashim 2008, Khyber 87, Shahkar 2013.\n\nIn Balochistan:\n● Sarsabz 79, Zameendar 80, Zarlishta 99, Faryab 92, Rashkwal 2005.\n\nIn Azad Jammu and Kashmir:\n● Uqab 2000, Chakwal 97, Margalla 99, Wafaq 2001.\n\nFor Harvesting Information:\n● Before harvesting, select areas of the field where the crop is not wet and is in good condition for seed selection. It is advisable to use a combine harvester for harvesting to save time and reduce grain loss.\n\nFor Pest, Disease Management, and Control:\n● For Karnal Bunt disease: To protect wheat crops from Karnal Bunt, cultivate varieties with resistance against Karnal Bunt, as recommended by the Department of Agriculture.\n● For Rust disease: Cultivate varieties with resistance against Rust, as recommended by the Department of Agriculture.\n\nFor Fertilizer Use:\n● Soil Type:\nFertile Irrigated Areas: At the time of sowing, use 3 bags of Single Superphosphate, half a bag of Urea, and one bag of Potassium Sulphate or 2 bags of Nitrophos and one bag of Potassium Sulphate. Add one bag of Urea with the first and second watering.\nWeak Irrigated Areas: Use 5 bags of Singlephosphate, 1 bag of Urea, and one bag of Potassium or 2 bags of DAP, half a bag of Urea, and one bag of Potassium Sulphate. Add one bag of Urea.\n\nSoil Type: Weak Irrigated Areas:\nAt the time of sowing:\nUse 5 bags of Single Phosphate, 1 bag of Urea, and one bag of Potassium or 2 bags of DAP, half a bag of Urea, and one bag of Potassium Sulphate. Add one bag of Urea with the first and second watering.\n\nSoil Type:\nRainfed Areas:\nAt the time of sowing, use 2 bags of DAP, half a bag of Urea, and one bag of Potassium Sulphate, or 3 bags of Nitrophos and 1 bag of Potassium Sulphate. Add fertilizer after the first and second watering.\n\nSoil Type: Progressive Landowners:\nAt the time of sowing, use 2 bags of DAP, 2 bags of Urea, and 1 bag of Potassium Sulphate, or 5 bags of Single Superphosphate, 1.5 bags of Urea, and 1 bag of Potassium Sulphate. Add fertilizer with the first and second watering.\n\nFor Soil Preparation and Sowing:\nFor optimal growth and yield of plants, it is essential to have soft, crumbly, and weed-free soil, allowing the plants to easily absorb water and other essential nutrients from the soil. Following these recommended practices for soil preparation can achieve the desired results:\n● Irrigated Areas:\nAfter plowing the soil once, level the land. Then, plow 4 to 5 times and prepare the seedbed.\n● Rainfed Areas: Plow deeply once, strengthen the field's bunds to maximize rainwater absorption. After the rain, plow twice to conserve moisture.\n● Irrigated Areas: Early sowing from 25th Oct to 20th Nov, mid-sowing: 20th Nov to 5th Dec, and late sowing until the end of Dec.\n● Rainfed Areas: Complete sowing by 15th Nov.",
    "CANE CULTIVATION\nFOR SUGGESTIONS ON IRRIGATION:\n\n    Approximately 1600 to 1800ml of water per inch is required for a good sugarcane crop throughout the year.\n    Apart from rainfall, irrigation is needed 15 to 18 times. Using the right amount of water at the right time is essential for better yield. Depending on the intensity of the weather, irrigation should be done approximately 12 to 14 days in April, 8 to 10 days in May and June, 15 to 17 days in July and August, 15 to 20 days in September and October, and 20 to 30 days from November to February. Water should be stopped a month before harvesting to ensure the crop matures properly. Continuous irrigation should be maintained for seed cane. Fertilizer should also be applied at the right time when the crop receives water appropriately.\n\nFOR TYPES OF SEED CANE:\n\n    In thin varieties of sugarcane, use 90 to 100 kg of seeds per acre.\n    In thick varieties of sugarcane, use 100 to 120 kg of seeds per acre.\n\nIN PUNJAB: AREAS:\n\n    Punjab has seen progress in various types of sugarcane, such as SPF 234, KPF 231, or 246, FEOJ 84, CPF 43, or 33, CP 2086, or 72, CP 400, or 77, CPS 246, or 237, SPSG 26, SSH 240, or 242, SPF 245.\n\nIN SINDH: AREAS:\n\n    Areas: Hyderabad, Southern Regions\n    Progressive types: Bag 4, Gulabi 95, NIA 2004, NIA 98, Kattadas NIA 2004, NRK 2001.\n\nIN KHYBER PAKHTUNKHWA: PROGRESSIVE TYPES:\n\n    CPN 13, CO 1321, Mardan 92 or 93, CP 400 or 77, NS 98, NCPK 42, Mardan 2005, SPSG 25, or 394.\n\nFOR HARVESTING INFORMATION:\n\n    Stop irrigation a month before harvesting the crop, and do not leave the crop in the field for too long after harvesting.\n    Cut the crop about 1 to 1.5 inches below ground level. Harvest the early-maturing varieties in November, the middle-maturing varieties in December, and the late-maturing varieties in February. Crops harvested in February or March yield better quality.\n\nFOR PESTS, DISEASES, AND THEIR CONTROL:\n\n    Sugarcane crops are susceptible to various pests, leading to reduced yield. Therefore, the use of pesticides and chemical treatments should be minimized. Common pests include different borers, sugarcane aphids, and termites. These pests can be controlled through natural and chemical methods.\n\nNATURAL CONTROL AND CHEMICAL CONTROL:\n\n    In the natural control method, farmers can use beneficial insects such as Trichogramma for aphid control. Several sugar mills in Punjab and Sindh have implemented this program successfully.\n    Chemical control involves the use of different chemical pesticides. Consult with local agricultural experts and reputable companies specializing in pest control for guidance.\n\nIMPORTANT DISEASES OF SUGARCANE AND THEIR CONTROL:\n\n    Sugarcane crops are vulnerable to various diseases that can significantly impact yield and sugar content. Diseases like red rot, smut, wilt, sugarcane mosaic virus, leaf scorch, and sugarcane rust are common. To prevent these diseases, use healthy and disease-resistant seeds, rotate crops, and employ proper farming practices.\n\nFERTILIZER USAGE:\n\n    In Punjab, use 3 bags of urea, 2 bags of DAP, and 2.5 bags of sulfate or potash.\n    In Sindh, use 4 bags of urea, 2 bags of DAP, and 2 to 2.5 bags of sulfate or potash.\n    In Khyber Pakhtunkhwa, use 3 bags of urea, 2 bags of DAP, and 2 to 2.5 bags of sulfate or potash.\n\nLAND PREPARATION AND SOWING:\n\n    Proper land preparation is crucial for better yield. Sugarcane roots go deep, so plow the land deeply and compact it using a chisel plow. Afterward, use a disc harrow to incorporate fertilizers into the soil. You can also use well-decomposed cow dung as organic manure. Sugarcane can be planted from September to February, with higher yields in September. In saline soils, irrigate the field after planting. The use of furrow planting is common in our region. Prepare rows with the help of a ridger. Plant healthy seeds or approved varieties with 2-2 eyes, sowing them end-to-end, and cover with 2 to 3 cm of soil.",
    "COTTON\nInformation for Irrigation:\n\n    Irrigation plays a crucial role in cotton cultivation. Constant irrigation and maintaining the right amount of water helps in preventing unnecessary growth and maintains a balance in soil texture.\n\n    For cotton sown in rows or beds, the first irrigation should be done 2 to 3 days after sowing, and subsequent irrigations should be carried out every 6 to 9 days. For traditional types of cotton sown in rows or beds, the first irrigation should be after 3 to 4 days, and then considering the seasonal conditions, continue irrigating every 6 to 10 days. For cotton sown using the drilling method, the first irrigation should be 30 to 35 days after sowing, and the rest every 12 to 15 days. Ensure that the cotton plants do not suffer from water scarcity during flowering and boll formation.\n\n    Give the last irrigation to cotton between October 5th and 15th to protect the crop from pests and enable timely harvesting.\n\nFor Regional Varieties of Seeds:\n\n    IR3701, suitable for: fertile agricultural areas of Punjab like Bahawalpur, Rahim Yar Khan. Sowing time: April 15th to May 15th.\n    Ali Akbar 703, suitable for: Bahawalpur, Rahim Yar Khan, D.G. Khan, Rajanpur areas with less virus and early cultivation. Sowing time: March 1st to April 15th.\n    MG6, suitable for: less fertile and less irrigated areas of Bahawalpur, Muzzafargarh, Bahawalnagar. Sowing time: April 1st to May 15th.\n    Variety 17008, suitable for: central fertile cotton areas like Khanewal, Multan, Vehari, Lodhran. Sowing time: March 1st to May 15th.\n    SH113, suitable for less fertile and dry lands in Bahawalpur, Rahim Yar Khan, Rajanpur, T.J. Khan, Layyah, Muzaffargarh, Dera Ghazi Khan, Haroonabad, Fort Abbas, Bakhar, and tough terrains of Bahawalpur. Sowing time: April 15th to May 15th.\n    NEELUM121, suitable for: fertile and irrigated areas of Okara, Sahiwal. Sowing time: March 1st to April 3rd.\n    Ali Akbar 802, suitable for: areas with high virus presence in Multan, Muzafargarh, Khanewal, and secondary cotton areas. Sowing time: April 15th to May 15th.\n    IR1524, suitable for: less irrigated areas of southern Punjab like Bahawalpur and Bahawalnagar. Sowing time: April 15th to May 15th.\n    GM HYBRID2085, suitable for: fertile secondary areas of Punjab for progressive farmers. Sowing time: April 15th to May 15th.\n\nFor Harvesting Information:\n\n    When harvesting cotton, focus on these principles for clean and high-quality yield:\n\n    Harvest cotton when 40 to 50% of bolls have opened.\n    Begin picking after dew has dried, usually around 10 am, and store the picked cotton in a dry and clean place.\n    Harvest American cotton every 15 to 20 days, and local cotton every 8 to 10 days to avoid wastage of opened bolls.\n    Use cloth bags for storing and transporting harvested cotton. Avoid using polythene or plastic bags.\n\nFor Pest, Disease Control, and Prevention:\n\n    Certain pests can damage cotton from start to end, requiring timely prevention.\n    Farmers should consult agricultural experts for appropriate pesticide use as soon as pest numbers reach damaging levels. Avoid repeated use of the same pesticide.\n    The best time for pest control is in the morning or evening when pests are active. Avoid pest control during intense sunlight as pest activity slows down. Be cautious with pesticide use to avoid resistance.\n\nFor Fertilizer Use:\n\n    Most soils in Pakistan lack nitrogen and phosphorus, while 50% are deficient in potash. Farmers often use these fertilizers disproportionately.\n    Imbalanced use of fertilizers can lead to phosphorus and potash deficiencies, while excess nitrogen gives the crop a healthy appearance but results in lower yield, lighter bolls, and shedding.\n\nFor Soil Preparation and Sowing:\n\n    Cotton, a major cash and fiber crop in Pakistan, contributes significantly to the economy and provides raw material for the textile industry, greatly contributing to exports. It also provides employment. Fertile, level, and well-drained soil with adequate organic matter and water retention capacity is ideal for cotton cultivation.\n    Cotton can be cultivated on raised beds, but avoid sowing in sloped areas.\n    Prepare the soil to incorporate residues from previous crops thoroughly. Deep plowing is beneficial for root development and plant health. Use laser land leveling to ensure even irrigation and cultivation for better soil texture and moisture retention.\n\nSeed Selection, Preparation, and Sowing Rate:\n\n    Use healthy seeds for better germination and yield. Discard diseased or infested seeds. Treat seeds with sulfuric acid and then rinse thoroughly. A sowing rate of 3 to 4 kg per acre is generally adequate. Separate floating seeds during rinsing and dry them well. Increase the seeding rate if the germination rate is low.\n    Use the appropriate amount of treated seeds per acre. In drill sowing, use 6 to 10 kg per acre. For row or bed sowing, use 6 to 8 kg per acre.\n    Treat seeds with appropriate insecticides to protect the early stages of the crop from pests.\n\nCotton Cultivation Methods:\n\n    Cotton is generally cultivated in two ways:\n\n    DRILL SOWING: Sow cotton immediately after soil preparation when moisture is adequate. Sow early in the morning or in the evening to avoid desiccation. Use a cotton driller for direct sowing in rows, maintaining a depth of 2 to 2.5 inches and row spacing of 2.5 feet. Re-sow if necessary due to rain or other factors. After the first irrigation, alternate rows can be covered with soil to conserve water.\n\n    ROW/BED SOWING: This modern method is effective in preventing damage from unexpected rains and helps in water conservation. It's particularly beneficial in clay and loamy soils. Maintain the recommended spacing for rows and plants.\n\n    For bed preparation and sowing: Create 2.5 feet wide beds at a height of 8 to 10 inches. Seeds can be sown manually or using a machine. For manual sowing, irrigate the furrows and place seeds at the desired spacing above the water level. For machine sowing, first place well-treated seeds along the edges of the bed using a planter, then irrigate the furrow so that the water level is 2 inches below the sown seeds. Apply the second irrigation 4 to 5 days later for good germination.",
    "CORN\nInformation for Irrigation:\n\n    Corn cultivation is highly sensitive to irrigation. The first watering should be done 3 weeks after sowing, and then as needed, ensuring that water does not stagnate in the field as it could kill the plants. Proper drainage must be arranged to prevent rainwater from accumulating in the field.\n\nFor Regional Varieties of Seeds:\n\n    Pioneer hybrid varieties for corn:\n        For the autumn season, hybrid corn varieties include: 3r50, 3025white, 30y87, 31r88, which are suitable for irrigated areas. For hill corn cultivation, hybrid varieties include 32b33, 31p41, 33m15, p1543.\n        Local corn varieties such as Sahiwal 2002 are cultivated in Multan Division, Faisalabad, Jhang, Chiniot, Okara, Sargodha, Mianwali, and Sialkot.\n\nFor Harvesting Information:\n\n    Harvest the crop when the kernels in the cob of hybrid varieties turn white, and in local varieties when they turn completely yellow. For corn grown for fodder, start harvesting when 50% of the flowers have appeared. The crop is usually ready for harvesting 55 to 65 days after sowing.\n\nFor Pest, Disease Control, and Prevention:\n\n    A common disease in Pakistan's corn crops is stem rot. Infected parts emit a bad smell, and leaves turn yellow and dry out, causing significant yield loss. To protect the crop from this disease, cultivate varieties with good resistance. Maintain soil fertility, especially ensuring no potassium deficiency, as the disease spreads due to lack of potassium, causing substantial losses to farmers in Pakistan.\n\nFor Fertilizer Use:\n\n    For a good yield of corn, balanced fertilizer use is essential. Mix farmyard manure with soil while plowing before sowing. At the time of sowing, use one bag of DAP and half a bag of potash, and add half to one bag of urea when the crop reaches 1.5 to 2 feet in height. Spraying urea mixed in water is more beneficial and positively affects plant growth, but most farmers in Pakistan apply urea by hand, which does not fully utilize the benefits of the fertilizer.\n\nFor Soil Preparation and Sowing:\n\n    Heavy plowing is crucial for corn cultivation. Prepare the land by running a rotavator followed by four plowings and harrowing to level the field. The appropriate time for sowing spring corn is from January to February, and for autumn corn, from July to August.\n    Generally, seeding is done using a broadcasting method, but for better yield, use a seed drill. Maintain a row spacing of 2 to 2.5 feet for seed production.",
    "GROUNDNUT\nInformation for Irrigation:\n\n    Irrigation depends on seasonal conditions. Irrigate the crop according to its needs, ensuring that water does not stand in the field as it can harm the plants. Proper drainage is crucial to prevent waterlogging during rains.\n\nFor Regional Varieties of Seeds:\n\n    For maximum yield, it is recommended to cultivate progressive varieties that not only have high yield potential but also resistance to drought, diseases, and pest attacks. For this purpose, groundnut varieties like Bari 2000 and Bari 2.11 should be cultivated. The ideal time for sowing groundnut is from the last week of March to April. In rainfed areas, the best time for sowing is throughout April, while in irrigated areas of Punjab, complete sowing in March. Always sow groundnut in rows, with a seed depth of 5 to 7 cm, row spacing of 45 cm, and plant spacing of 15 cm. Avoid broadcasting when sowing groundnut.\n\nFor Harvesting Information:\n\n    The harvesting process is crucial for achieving maximum yield and quality of groundnut. The selection of the right time for harvesting is very important. Early harvesting can result in a higher proportion of immature pods, reducing the yield, while delayed harvesting can lead to pods remaining in the soil. Modern groundnut varieties mature in 6 months. Start checking the crop when the leaves begin to dry and fall. Pull out plants from different parts of the field for inspection. If the inner part of the pod shell turns dark pink or brown, the crop is ready for harvesting. Using a tractor trigger for harvesting reduces loss and increases yield. If a tractor trigger is not available, uproot the plants with a spade, then separate the pods. A thresher can be used for this purpose. Collect buried pods as soon as possible to prevent damage from moisture. Dry the pods in the sun for at least a week on a clean surface. Avoid storing the pods in heaps as it can affect their color and quality. Clean the pods with a tractor-driven fan to separate immature and rotten pods. Before storage, dry the pods thoroughly. Store clean and dry pods in cloth bags in cool, ventilated, and clean warehouses. Ensure that the moisture content of the stored pods does not exceed 10%. Warehouses should have proper arrangements to protect against termites, pests, and rain.\n\nFor Pest, Disease Control, and Prevention:\n\n    Groundnut crops are attacked by several diseases, including leaf spot, cane of stem and pod, and wilting of plants. To prevent these diseases, it is essential to use healthy, beneficial seeds and treat them with recommended pesticides before cultivation. Remove and bury or burn infected plants from the field.\n    Groundnut Pests and Their Control:\n    Groundnut crops are attacked by various pests, including termites, crickets, caterpillars, and hairy caterpillars. These pests cause significant damage, so repeat the application of recommended pesticides for protection. When there's dew on the plants in the morning, remove weeds, set up light traps for moths, and also protect against rodents and wild boars. Follow agricultural department recommendations for pest control.\n    For Fertilizer Use:\n    Fertilizer recommendation for groundnut:\n        First application: Nitrogen 12, Phosphorus 25, Potash 12, and the quantity of fertilizer per acre includes half a bag of urea, one bag of DAP, and 1.5 bags of potassium sulfate.\n        Second application: Nitrogen 12, Phosphorus 25, Potash 12, and the quantity of fertilizer per acre includes 1.5 bags of urea, 3 bags of single superphosphate, and 1.5 bags of potassium sulfate.\n        Third application: Nitrogen 12, Phosphorus 25, Potash 12, and the quantity of fertilizer per acre includes half a bag of TSP and half a bag of potassium sulfate.\n        For Soil Preparation and Sowing:\n    Groundnut is an important crop in rainfed areas during the Kharif season, especially in the Potohar region. It is a profitable crop compared to other crops in terms of cash income. It plays a significant role in improving the economic conditions and living standards of farmers in rainfed areas. That's why it is referred to as 'golden crop'. Light loam soil is ideal for groundnut as its soft and crumbly nature allows easy penetration and growth of groundnut pods. Prepare the land 3-4 times with plowing. Initially, in late January or early February, deep plow once to ensure rainwater is absorbed and retained in the soil for a longer duration.\n        After rains, plow twice whenever the field is dry. Before the final preparation of the land for sowing, apply the recommended amount of fertilizer using a drill. If a drill is not available, apply fertilizer without broadcasting and plow once to ensure even, soft, and crumbly soil surface. This helps in water retention at the upper soil layer, aiding in seed germination and early growth.",
    "GUAVA:\nInformation for Irrigation: Irrigation depends on the local climate and soil characteristics. Young plants should be watered regularly throughout the year. Mature plants require more water when fruits are forming. Stop irrigating when fruits are maturing until they are fully ripe. In winter, watering the plants weekly is better for improving fruit quality and protecting the fruits from cold damage. Approximately, guava trees require irrigation 12 to 15 times a year.\nFor Regional Varieties of Seeds: The following are some guava varietie\n    Larkana Sarahi: This variety has elongated fruits with a rough skin and white flesh. It has few seeds and yields about 100kg per tre\n    Shark Poori Gulab: This variety has round, white, medium-sized fruits with a clear skin, delicious and sweet taste. It has more seeds and yields 70 to 90 kg per tre\n    Karela: This variety has elongated, pear-shaped fruits with rough skin. The flesh can be red or white, and the average yield is 75 kg per tre\n    Surkha: This variety has round fruits with red flesh. It is called Surkha due to the red color of the flesh. It has less sweetness and yields about 75 to 80 kg per tree. Its fruits are used for making jam.\nFor Harvesting Information: Guava produces fruits twice a year. One crop is in the summer from July to August and another in the winter from January to February. The yield can range from 70 to 100 kg per tree. Harvest the fruits twice a week as guava fruits spoil quickly. Prompt grading and selling of the fruits can increase the income of Pakistani farmers.\nFor Pest, Disease Control, and Prevention: The most damaging pest to guava's summer crop is the fruit fly, which lays eggs inside the fruit, leading to small larvae that eat the flesh, causing the fruit to fall to the ground. In recent years, a disease called wilting has been common in Pakistan. In this disease, the branches die, leaves turn yellow or brown, the bark near the roots and stem dries up, and within a few months, the tree dies. This disease is caused by a fungal attack on the roots. Avoid overwatering affected trees and treat the roots for fungal infections.\nTreatment: Bury all fallen guava fruits into the ground. When the fruit grows big, spray with Metasystox or Dipel mixed in water. Stop spraying 20 days before harvesting.\nFor Fertilizer Use: Guava trees bear fruits twice a year, so they need a good amount of nitrogen fertilizer. Cow dung is considered the best, and 30 to 40 kg per tree should be applied. Generally, cow dung should be given from December to January. Apply the manure according to the spread of the tree, till the soil around it, and then irrigate. In chemical fertilizers, use ammonium sulfate 28 to 30 kg per tree, or urea 1.25 to 1.5 kg, superphosphate 28 to 30 kg, and 1 kg of potash or potassium sulfate per tree before the fruiting season.\nFor Soil Preparation and Planting: Guava trees can be grown in heavy to light loamy soils and are successful in a variety of soils, but for better yield, soft and fertile soil is essential for other fruit-bearing trees as well. The best time for planting guava is August or September. Trees planted in February or March risk heat stress in June. Water immediately after planting. A distance of 6 meters between trees is essential.",
    "GRAPES:\nFor Pest and Disease Control and Prevention: Grape diseases include powdery mildew and anthracnose. The pests affecting grapes are only millipedes and termites. Downy mildew causes white spots on leaves which then dry up. This disease spreads very quickly. To prevent it, mix 1 liter of thinosulfate higram with water, collect the dry leaves, take them away from the field, and burn them to stop the disease. For powdery mildew, white spots appear on the leaves which later turn yellow and fall off. To prevent this disease, dissolve 50ml of tenaclosar in 1 liter of water and spray it to protect the plant.\nAnthracnose: This fungal disease causes dark brown spots on the fruit. If not controlled, it can significantly affect yield. To protect the plants, dissolve 30ml of diphenalenazole in 1 liter of water and spray it.\nSirt (Pest): This pest sucks sap from the underside of leaves and weakens the plant's health. Dissolve 3gm of 80 set per liter of water and spray it.\nTermite, Termites: These pests cause significant damage to plants, making holes in the roots and killing the plant. While planting, spray 5ml of chloroperiphose with 3ml of water in the pit.\nFor Harvesting Information: Harvest the grapes when the berries are ripe and have reached their full size. Cut the bunches with scissors and place them in baskets in a way that the berries are not damaged.\nFor Irrigation Information: Water grapes for the first time in February, the second time in the first week of March, every 10 days in April, every 4 to 6 days from May to June, and once in November and January to ensure good yield and healthy fruit.\nFor Regional Varieties of Seeds: The varieties of grapes cultivated in the districts of Balochistan include:\n    White Kishmish, Sundal Khani, Surakh Kishmish.\n    Varieties cultivated in the plains of Pakistan that yield well include Kingrobi, Flame Seedless, Cardenel, and Narcblack.\nFor Fertilizer Use: Fertilizer application should be according to the type of soil. If farmyard manure is applied annually, the need for chemical fertilizers is reduced. Generally, using 150gm of NPK per plant before fruit formation increases yield. Applying another 150gm of NPK after berry formation positively impacts the quality of the fruit.\nFor Soil Preparation and Planting: Well-drained light loamy soil is essential for grape cultivation. Dig holes 1.5 feet deep and keep the top foot of soil separate. Leave the holes open for 2 months to allow sunlight and air to kill any germs. When filling the holes, mix the top layer of soil with decomposed cow dung and water it well to settle the soil. During hole filling, protect against root borer attacks by spraying 10ml of chloroperiphose with 3 liters of water into the holes. Use decomposed cow dung as manure.",
    "MANGO\n1.\n• FOR IRRIGATION INFORMATION: In a mango orchard, apply water according to the following guidelines. TIMING: Irrigate once in February and March. This increases the likelihood of more flowers. From April to the end of June, irrigate every 15 days. This practice improves fruit quality. JULY AUGUST IRRIGATION: Considering the rains, if there are fruits on the tree, irrigate every 15 days, otherwise once a month. EFFECT: Helps in the growth of the trees and the emergence of new branches. SEP OCT: Irrigate only once in September. Less frequent irrigation helps in forming flowers for the next year. NOV DEC AND JAN: Only irrigate if it's very dry. EFFECT: Irrigation during this period can significantly protect against the effects of cold and fog.\n2.\n• For regional varieties, the following cleaned types of mangoes are listed:\n• Yaktaa: An early variety that ripens in the first week of June. Large-sized fruit with dark yellow skin when ripe, pinkish-yellow flesh, sweet with fibers, and a medium-sized stone. Excellent taste. The tree yields about 120 kg per season and has a production capacity of 200 kg. This variety has a shorter post-harvest life but is excellent for local markets.\n• MAALDA: An early variety that ripens in June. Medium-sized fruit with green skin and yellow spots. Pinkish-yellow flesh, less fibrous, sweet taste, excellent quality, and a medium stone. Yields about 180 kg per tree.\n• Langra: A mid-season variety, ripening from the end of June to July. Medium-sized fruit, green to light yellow skin, pinkish-yellow flesh, medium fiber content. The stone is thin and small. Yields about 210 kg per tree.\n• Daseri: A mid-season variety ripening from the end of June to July. Medium-sized fruit with yellow skin, deep yellow flesh, less fibrous, crisp, very sweet, with a thin, small stone. Yields about 180 kg per tree.\n• Anwar detol: A mid-season variety ripening by early July. Small-sized fruit, greenish-yellow skin, pinkish-yellow flesh, fiberless, fragrant, sweet, with a thick stone. Yields about 180 kg per tree.\n• Cindri: A mid-season variety ripening in July. Large-sized fruit, deep yellow skin and flesh, medium stone, richer flesh, excellent quality. Yields about 300 kg per tree.\n• Chaunsa: A mid-season variety ripening by July. Medium to large-sized fruit, extremely high quality. Yields about 300 kg per tree.\n• Farjshi: This is a late-season variety. The fruit ripens in late August. The fruit is large, with a greenish skin and yellowish flesh, slightly red, with few fibers, sweet juice, and moderate to good quality. The average yield is 200 kg per tree.\n• Sensation: The fruit begins to ripen in late August. It has a medium size, pear-shaped, and a purplish-pink color. The flesh is fragrant, minimally fibrous, tasty, sweet, and of moderate to good quality, with a soluble solid content of 20%. This variety is also excellent for storage. The average yield is 75 kg per tree.\n• Dettol no 12: This is a late-season mango variety that ripens in the third week of August. The fruit is similar in shape to Anwar detol but is inferior in quality and taste. It has more fibers compared to Anwar detol. The trees are of medium height and have become very popular among farmers in recent years due to their good fruiting habit and high yield potential. The average yield is 250 kg per tree, with a potential of 300 kg per tree.\n• Safaid Chaunsa: This is a late-season mango variety that ripens in the third week of August. The fruit is large with yellow skin, slight fiber, light yellow flesh, and a medium stone. The quality of the fruit is excellent. The average yield is 140 kg per tree, with a production capacity of 200 kg per tree. This variety is highly preferred in local markets and commands a better price compared to other varieties. Due to its high quality, it is also suitable for export.\n• For harvesting information, mango harvesting should begin when sweetness starts developing inside the mango fruits. At this time, the fruit reaches a specific size and its color changes. Early, mid-season, and late-season varieties should be harvested according to their respective seasons. Early varieties become ready for harvest at the beginning of June, mid-season varieties from the end of June to July, and late-season varieties from the end of July to August. Delayed harvesting of early varieties and premature harvesting of late varieties can affect the fruit quality. It has been proven that harvesting fruits prematurely increases acidity and reduces taste quality. Such fruits are sold at lower prices in the market. Care must be taken during harvesting to avoid dropping the fruits. They should be harvested with a 6-inch stem and should not be mixed with fruits that have fallen on the ground. They should be spread out and kept in a well-ventilated area. Before packing in crates, the fruits should be graded. Each crate should contain only one variety and size of fruit to prevent damage to the fruit at the bottom. It is advisable to pack the fruits in single-branch boxes.\nControl Measures for Pests and Diseases in Mango Cultivation:\n• Mango Mealybug: These pests suck sap from the soft parts of mango plants, including young fruits. In severe infestations, affected parts dry out and die. Infested leaves develop a black fungus due to the pest's secretion, disrupting photosynthesis. CONTROL MEASURES:\n    SOLUTION NO 1: JATARA: Mix 20 ml with 300 liters of water.\n    SOLUTION NO 2: SAMEDA: Use 100 to 150g in 300 liters of water.\n    • MILIPAG: These pests also sap nutrients from the mango plant, affecting fruit production. CONTROL: Use filephena at 250ml per 100 liters of water.\n    • Mango Fruit Borer: CONTROL: Use aametao at 200ml per 100 liters of water.\n• Aphids: They infest parts of the plant and lay eggs. The emerging larvae enter flowers and feed on the soft parts, causing them to dry and fall off. CONTROL: Use Jitara at 40ml per 100 liters of water.\n• Fruit Flies: Female flies make holes in the fruit and lay eggs inside. The larvae then feed on the fruit, making it unmarketable. CONTROL: Use 5 phena at 400ml per 100 liters of water.\n• Scales: Juvenile and adult scales suck sap from leaves and soft parts. CONTROL: Use 5 NAAN at 400ML per 100 liters of water.",
    "MANGO\n• To Control Fungal Diseases:\n    Powdery Mildew: A fungal disease affecting leaves, twigs, flowers, and young fruits, causing them to drop prematurely. CONTROL MEASURES:\n        SOLUTION 1: CONTASPLUS: Use 150 ml per 100 liters of water.\n        SOLUTION 2: Silfix Gold: Use 250 grams per 100 liters of water.\n        SOLUTION 3: ROLFAR: A modern fungicide that stops the growth of fungi by inhibiting the production of egosterol. It's effective both before and after disease onset. Use 50 ml per 100 liters of water.\n        • Mango Anthracnose: Symptoms include spots on leaves, blighting of leaf tips and margins, flower blight, twig blight, and black spots on young fruits. CONTROL MEASURES:\n    SOLUTION 1: ROLFER: Use 50 ml per 100 liters of water.\n    SOLUTION 2: CHAMPION: Use 250gm per 100 liters of water.\nFertilization Requirements for Mango Trees Before Fruiting (kg per tree annually):\n• TREE AGE:\n- First Year: No fertilizer.\n- Second Year: Compost 10-15 kg, urea 0.25 kg, ammonium sulphate 0.50 kg.\n- Third Year: 15-20 kg compost, urea 0.35 kg, ammonium sulphate 0.65 kg.\n- Fourth Year: 15-20 kg compost, urea 0.50 kg, ammonium sulphate 1 kg.\n- Fifth Year: 20-25 kg compost, urea 0.75 kg, ammonium sulphate 1.50 kg. Avoid fresh compost to prevent termite attacks. Fresh compost can also lead to nitrogen loss due to bacterial action.\n• For Mature Trees (6 to 7 years and older):\n- 6-7 Years: 30-40 kg compost, urea 1-1.5 kg, single superphosphate 1 kg, potassium sulphate 0.75 kg.\n- 8-10 Years: 70 kg compost, urea 2-2.75 kg, single superphosphate 2.5 kg, potassium sulphate 0.75 kg.\n- 10-14 Years: 80 kg compost, urea 3 kg, single superphosphate 6 kg, potassium sulphate 2 kg.\n- Over 14 Years: 120 kg compost, urea 4 kg, single superphosphate 8 kg, potassium sulphate 3 kg.\n• PREPARATION OF LAND FOR MANGO PLANTATION: Mango is often referred to as the king of fruits. It is rich in vitamins A and C and contains a significant amount of other nutrients. In terms of taste, mango holds a superior position among fruits. In Pakistan, mangoes are famous worldwide for their flavor. The province of Punjab in Pakistan is particularly known for its mango cultivation and production. Major mango cultivation areas in Punjab include Rahim Yar Khan, Khanewal, Vehari, Muzaffargarh, Multan, Bahawalpur, Faisalabad, Lahore, Dera Ghazi Khan, and Sargodha.\n- CLIMATE: Mangoes are cultivated at altitudes ranging from 650 to 950 meters above sea level. Excessive cold is detrimental. Although mangoes are tropical fruits typically thriving in areas with year-round rainfall, production and quality decline in such regions. Mangoes grown in warm, dry areas tend to have better quality, but these regions also pose risks of damage to young plants from heat in summers and fog in winters.\n- SOIL: Deep soil with good drainage is considered ideal for mango orchards. The soil should not have a hard layer of rock or gravel up to several meters deep. Mango cultivation is feasible on all types of soil except sandy and rocky terrains.\n- FIELD PREPARATION: Proper land preparation is essential before planting mangoes. After leveling the land, if organic manure is available, it should be incorporated into the soil, followed by plowing 5 to 6 times and leaving it open to sunlight and air. Mangoes are usually planted in a square pattern where the distance between each plant and row is equal. Shorter and less spreading varieties should be planted at a distance of 6.5 meters, while taller and more spreading varieties should be planted at a distance of 8.5 meters. The average spacing and number of plants per acre for different varieties are as follows:\n    - Varieties: Anwer Ratol, Daseri, Sensation, Yakta\n    - Plant-to-Plant Distance: 6.5 meters\n    - Number of Plants: 90\n    - Varieties: Langra, Chaunsa, Sindhri, Fajri\n    - Plant-to-Plant Distance: 8.5 meters\n    - Number of Plants: 55\n- PIT DIGGING AND FILLING: If the soil is fertile and free from salinity, dig a pit the size of the plant's root ball. If the soil is not fertile, mark the planting spots and dig a pit of one cubic meter. Keep the top 30 cm of soil on one side and the bottom 60 cm separately. Leave the pit open for 10 to 15 days to let air and sunlight sterilize it. Then fill it with a mix of the top 30 cm soil, manure, and soil, keeping the surface higher than the surrounding ground to prevent waterlogging.\n- PLANTING: When the weather is suitable, dig a hole equal to the size of the plant's root ball, plant the tree, and refill with soil, being careful not to break the root ball. Water immediately after planting. Mango plants can be planted in both autumn and spring, but those planted in spring have a higher survival rate. It is advisable not to plant other crops in the mango orchard as different plants have different requirements. However, intercropping can be practiced in the initial years of plantation.",
    "LEMON:\nFor irrigation information, in acidic fruit orchards, excessive water is more harmful than a lack of it. However, a prolonged shortage of water can also adversely affect acidic fruit orchards. One critical issue is that gardeners often overwater the orchards without considering the appropriate timing for irrigation. Furthermore, the water supplied by 12 tube wells for acidic fruits often contains more salinity than tolerable, leading to sudden orchard damage. Saline water negatively impacts both yield and fruit quality. The following measures can be taken to avoid such situations:\n\n    Check the soil at 3 to 4 places around the plant to a depth of 30-35 cm. If the soil is moist, irrigate immediately.\n    During the summer, if leaves start turning yellow and begin to shed, delaying irrigation can be fatal for the plants. Therefore, water them promptly.\n    If fruits start turning yellow from any side during the summer, it indicates the orchard needs water.\n    The need for water can be estimated using a tensiometer scale. If the scale reads above 35 units, it signifies that the tree needs water.\n    Stop watering about a month before flowering.\n    In cases where tube well water is used, it's crucial for the water to be suitable for acidic fruits. The soil's salinity should not exceed 800ppm; otherwise, plants may suffer detrimental effects.\n    Uniform watering is essential, which requires level ground.\n    Other important factors regarding irrigation include water scarcity or excess, duration of irrigation, and the use of green water in orchards.\n    WATER SCARCITY: Water shortage significantly affects the growth of sensitive fruits. The worst impact is fruit drop, especially in June, which is often due to water scarcity.\n\nEXCESS WATER:\nExcessive soil moisture is harmful for acidic orchards as it can lead to root rot, organ decay, and diseases that affect plant health. This may necessitate pruning or even replacing the plant. Excessive moisture also causes leaves to turn yellow and fall prematurely, and can lead to robnum disease. Similarly, cultivation during the rainy season can also be detrimental to acidic orchards, as plants require less water in winter, whereas rains provide excess water.\n\nDURATION OF IRRIGATION:\n- For mature plants, maintain a 10-15 day watering interval from April to September in warm climates, and extend this interval to a month in winter. However, adjustments can be made based on soil characteristics and climate. Avoid watering when plants are about to flower in spring, as this will encourage more flowering and fruit production. Special attention should be paid to irrigation after fruit formation. Experiments show that a high-quality tensiometer can be used, placed 12 inches deep in the soil within the plant's spread.\nUSING SALINE WATER FOR ORCHARDS:\nDue to the insufficiency of fresh water for crop cultivation, farmers are compelled to use groundwater, which is often not suitable for orchards. However, by taking certain precautions, damage from using saline water can be minimized. Firstly, it is essential for farmers to get a complete laboratory test of the water for soil analysis, available in every district. Additionally, advice from relevant institutions can be sought. Analysis can provide crucial information such as total salt concentration, sodium absorption ratio, and excess sodium carbonate.\nPRECAUTIONARY MEASURES: REDUCING THE INTERVAL BETWEEN WATERING:\n    Using saline water gradually accumulates salts in the soil, making it harder for plants to absorb water, leading to weaker plants and smaller fruits. Therefore, watering more frequently can help alleviate stress on the plants, as it reduces soil salinity and allows plants to absorb water more easily.\nEXCESSIVE WATERING:\n    Watering more than the required amount helps wash away the accumulated salts from the plant roots, reducing their concentration and eventually mitigating their harmful effects.\nALTERNATING BETWEEN SALINE AND FRESH WATER:\n    The use of saline water leads to the accumulation of salts in the soil. To dilute these salts and push them deeper into the soil, it is necessary to use water with lower salinity. Therefore, alternate irrigation with canal water and tube well water.\nREGIONAL VARIETIES FOR SEEDLESS CITRUS FRUITS:\n    The Citrus Research Institute has developed 2 to 3 seed-bearing Kinnow mandarin varieties, with very few plants having up to 5 seeds. Over the past years, the Institute has distributed a significant number of these plants to farmers to improve fruit quality and access new markets.\n    Other popular varieties in Pakistan include Honey Mandarin and Clementine.\nVARIETIES OF ORANGES:\n    The Citrus Institute Research has introduced several high-yielding seedless orange varieties, which have shown promising results, including:\n        SALISINA\n        MARSHVELI\n        CRAKO\n        NEVLENA\n        MOROBLOD\n        OLINDA VELINKA\n    For harvesting, individual fruits should be cut from the branches with the help of knives and safely stored in baskets to avoid damaging them.",
    "LEMON:\nPESTS AND DISEASES IN ACIDIC FRUITS:\n    Acidic fruits are susceptible to various pests and diseases, which can cause significant damage. It has been observed that many gardeners do not pay enough attention to this crucial aspect, leading to their orchards becoming victims of various pests and diseases, resulting in financial losses.\n    IMPORTANT PESTS IN ACIDIC FRUIT ORCHARDS AND THEIR CONTROL:\n    Acidic fruit orchards are attacked by various pests that not only reduce the lifespan of the orchard but also affect the quality of the fruit, significantly reducing the production of export-quality fruits. These pests can cause up to 15% loss. Timely control can not only increase the fruit's lifespan but also improve its quality and quantity. The main pests in acidic orchards include:\n        Citrus psylla\n        Citrus butterfly\n        Citrus scale\n        Whitefly\n        Aphid\n        Tunnel-making caterpillar\n        Fruit fly\n        Thrips\n        Citrus mite\n        And Citrus mealybug.\n    IDENTIFICATION OF TUNNEL-MAKING CATERPILLAR:\n    The moth is silver-white, while the caterpillar is light yellow with an older head, which lives inside the leaves, creating tunnels.\n    \n        DAMAGE: This pest attacks new growth. The caterpillars eat the insides of leaves, creating tunnels, and causing the leaves to crumble. This pest is also known as the citrus tanger and controlling it is crucial.\n        CONTROL: Spray lightly on new growth following the advice of the agricultural department.\n    \n    IDENTIFICATION OF CITRUS BUTTERFLY:\n    The butterfly is green with black wings, which have yellow spots. The caterpillar grows up to 2 to 3 inches.\n    \n        DAMAGE: The caterpillars eat the leaves, causing branches to become weak. Major attacks occur in March and August-September.\n        CONTROL: As soon as caterpillars are spotted on new flowers, spray insecticides like bifenthrin or lambda-cyhalothrin. Additionally, gather and destroy larvae found on new growth.\n        GADERI: IDENTIFICATION OF GADERI: This is a sap-sucking insect whose young initially resemble very fine lice. They are yellow and orange in color, which later turns to a whitish hue.\n        • DAMAGE: Thousands of offspring emerge from eggs. They start climbing on plants and sit on delicate buds to suck sap.\n        • Leaves turn yellow and remain small. The fruit falls before ripening. This insect causes an itchy substance on the body, leading to fungus on the leaves\n        • and damages them.\n        \n        CONTROL:\n        • In April, the female lays eggs in the ground, which remain there until December. Eliminate these eggs before December. Dig around the base of the plant up to 6 inches and spray insecticide on the eggs. Prevent the young from climbing the stem. For this, wrap a plastic sheet around the base of the stem. In December and January, as soon as the offspring begin to emerge from the eggs, spray insecticide based on the advice of the agriculture department.\n        \n        IDENTIFICATION OF CITRUS SKILs: There are two types of these insects:\n        • 1. Hole shell\n        • 2. Cutting skill\n        \n        Hole shells are thin, orange, and round, sticking to the surface. Cutting skill is a thin insect that is round and clings to the branches.\n        • DAMAGE: They suck sap from branches and fruits, causing spots on the fruit. In severe infestations, branches dry out.\n        • CONTROL: From July to November, the infestation intensifies, so spray insecticide based on the advice of the agriculture department during these months, adding a little poison so that the medicine sticks to the insects.\n        IDENTIFICATION OF FRUIT FLY: The color of the fly is dark reddish-brown. The caterpillar is white or yellow, and the abdomen has yellow stripes.\n        • DAMAGE: The female fly lays eggs inside the fruit, from which caterpillars emerge and grow by eating the fruit's core. Their pupa also joins the core\n        • and the fruit rots, and this insect lives all year round.\n        • CONTROL: Collect and bury fallen fruit daily.\n        \n        Use sexual attraction traps and METHYL, using 6 traps per acre. Spray a solution of 1 gram of trichloropharm per liter of water.\n        \n        IDENTIFICATION OF WHITEFLY:\n        The fly is yellowish in color with a body covered in white fluff.\n        • DAMAGE: Adults and young suck sap from the underside of leaves, causing damage. Its body secretes a honey-like substance which leads to the spread of fungus.\n        • CONTROL: They cause more damage in March and April, so as soon as the fly is spotted, spray insecticide based on the advice of the agriculture department.",
    "LEMON\nCITRUS SMAI IDENTIFICATION:\nThis is a small and slow-sized insect. It has a yellowish-red color with deep brown spots. It is more prevalent in warm and dry climates.\n• DAMAGE: Adults and offspring suck sap from leaves and delicate fruits, causing damage. The surface of the fruit gets spoiled and becomes unfit for consumption or export. \n• CONTROL: Spray a solution of 2ml aimal methan per liter of water.\n• IDENTIFICATION OF THARPAS: This is a small insect. It is reddish in color with a dark hue. Both juveniles and adults cling to the surface. They stick to the fruit stems,\n• and the fruit becomes unfit for export. They usually attack right after fruit formation.\n• CONTROL: Spray a solution of 20ml panacel per 100 liters of water. After fruit formation, spray every 10 to 15 days.\nIMPORTANT DISEASES AND CONTROL IN TURSHAWA ORCHARDS:\n• Wilt in Yogurt Plants: This disease is caused by the attack of two or three types of fungus, affecting the roots and leaves of the plants. The roots of young plants die.\n• CONTROL\nConstruct yogurt pits on elevated ground, apply water in appropriate amounts. Boil seeds in hot water for 10 minutes at 52°C and then sow. Treat seeds with antifungal agents before planting. In case of severe infestations, spray texin or red milgus.\nGUMMOSIS:\n• This disease is caused by fungus. It attacks the entire root system, stems, branches, and fruit of the plant. In case of root attack, the roots rot, and the bark peels off. When the stem is attacked, cracks form in the bark and it begins to ooze gum. In case of branch attack, gum oozes and the branches dry up. During heavy rain, the fruits near the ground are attacked and rot. Due to this disease, 20% of the plants in the nursery die.\n• CAUSES: Temperature between 25-35°C, overwatering, injuries to the stem or roots due to digging.\n• CONTROL: Prevent damage to the plant. Keep water 2 or 3 feet away from the stem. Maintain raised beds at least one foot above the ground level.\n• SYMPTOMS OF CITRUS SCAB: \nThis disease is caused by a fungus and attacks new leaves and branches. In severe cases, leaves and fruits fall off. The lower parts of the leaves are heavily attacked and die. If the fruit is attacked, scab-like spots appear on the peel. The fruit hardens and falls before ripening.\n• CAUSES: Temperatures between 25 to 35°C, humidity in the air. Attacks can occur any time from May to December, with severe outbreaks from July to December. Continuous rain for 2 to 6 days and cloudy weather for 6 to 10 days increase the severity of the disease.\n• CONTROL: Collect and burn diseased leaves. Spray kaperoxycorite on new shoots every 15 to 20 days, twice\n\nCAUSES OF INSECT INFESTATION ON FRUIT:\nPoor health, climatic changes, lack of water, improper irrigation, unsuitable crop cultivation, and pest attacks are causes. The disease causes the fruit to rot from the stem end. When temperatures are between 28 to 30°C and there is heavy rainfall, the fruit rots from the stem end and falls.\n• CONTROL: Apply water in appropriate amounts and at suitable times. Spray for insects. Avoid cultivating unsuitable crops. In case of disease attack, cut off dry branches. Apply two sprays of Carbonysm 15 days apart.\nBACTERIAL BLIGHT OF TURSHAWA FLOWERS:\n• This is a bacterial disease. Bacteria attack leaves and fruits. Spots form on leaves that sting when touched. In severe cases, brown spots form, making the fruit unfit for export. The disease spreads rapidly in July and August when temperatures are between 20 to 30°C and there are stormy rains. Bacteria can live on leaves for one to two years, on branches for three to four years, and in the soil for up to two months.\n• CONTROL: Avoid cultivating highly susceptible varieties such as lemon, grapefruit, lime, and mosambi. Cut and burn affected leaves and branches under the plants. Acquire plants from nurseries that are free from kangus disease. Attacks on new flowers are severe, so spray copper-based medicines on new blooms and use bisynthesi spray to control them.\n• For fertilization, when the plant is one year old, use 10kg of cow dung manure, 100 grams of nitrogen, 50 grams of phosphorus, and 50 grams of potash. When the plant is two years old, use 20kg of cow dung manure, 200 grams of nitrogen, 100 grams of phosphorus, and 100 grams of potash. For a three-year-old plant, use 30kg of cow dung manure, 300 grams of nitrogen, 150 grams of phosphorus, and 150 grams of potash. For a four-year-old plant, use 40kg of cow dung, 400 grams of nitrogen, 200 grams of phosphorus, and 200 grams of potash. For a five-year-old plant, use 50kg of cow dung, 500 grams of nitrogen, 250 grams of phosphorus, and 250 grams of potash; continue applying manure annually as recommended by the department of agriculture.\nSOIL PREPARATION AND SOWING FOR TURSHAWA FRUITS:\nThe soil for Turshawa fruits should have the following characteristics:\n• 1. Light loamy soil with a pH between 7 to 7.5 and good drainage.\n• 2. The soil should contain at least 1% organic matter.\n• 3. The water table should be at least 8 to 10 feet below the surface. There should be no gravel or hardness, and layers of calcium carbonate should be present.\n• Turshawa fruits are not suitable for saline or semiarid soils, nor for soils with salinity over a thousand ppm.\n• For planting Turshawa fruit-bearing plants, the land must be level. Once it is properly leveled, cultivate green manure crops and incorporate them into the soil before the monsoon using a disk harrow. These crops improve soil drainage and increase soil moisture. Plants grow better in fertile soils with good drainage, so do not plant them closer than the recommended distance, i.e., ideally plant them in a square pattern with 20 feet between each plant. However, a spacing of 18 by 18 feet is also suitable, resulting in 136 plants per acre. For drip irrigation systems, maintain a distance of 20 feet between rows and 15 feet between plants, resulting in 116 plants per acre.\nDIGGING PITS: After marking the spots for planting in the orchard, dig pits measuring 3 by 3 by 3 feet. Separate the top one foot of soil and keep it aside, and do the same with the remaining soil. Leave the pits open for 2 to 3 weeks to allow the sun and air to eliminate diseases and germs.\nFILLING THE PITS: Before planting, fill the pits with an equal mix of the top one foot of soil and farmyard manure, thoroughly mixing them. Water the mixture so that the soil settles well. However, before filling the pits, spraying them thoroughly with antifungal medicine like redomil gold ensures that the roots of the plants will be protected from diseases.\nMETHOD OF PLANTING:\nAfter preparing the pits, make a slightly larger hole at the correctly marked spot for each plant. Place the root ball of the plant upright in this hole. Ensure that the root ball is level with the ground surface and firmly pack the soil around it to eliminate air gaps. Immediately after planting, water the plant.",
    "OLIVE\n• IRRIGATION INFORMATION: Although olive trees are capable of withstanding drought, for better yield, young trees should be watered every 4 to 7 days, and mature trees every 15 to 20 days, depending on soil structure and climate. Ensure that water does not touch the trunk. For this purpose, pile some soil around the lower part of the trunk. Irrigation is essential after flowering and fruit formation, and a month before fruit ripening. Drip irrigation can significantly save water by providing it directly to the roots through small tubes, saving time and helping to control weeds.\n• FOR SELECTING LOCAL VARIETIES OF SEEDS: Barri Zaitoon 1, Barri Zaitoon 2, Lesmiyoun Pendolino, Autogrotica, Gramtlic, Nabali, Arbequina, Arbosana are recommended.\n• HARVESTING INFORMATION: Different varieties of olives become ripe for picking during September and October. They can be harvested by hand or machine. To ease the harvesting process, a chemical spray is sometimes used which weakens the stem's attachment to the fruit, making it easier to pick. After picking, the fruit should be processed and preserved quickly. Mechanically harvested fruit can get damaged, so it's important to preserve them in various ways within a few hours to maintain quality.\nPEST, DISEASES, AND THEIR CONTROL:\n• Compared to other fruit-bearing trees, olives are less prone to pests and diseases. However, during the monsoon, due to humidity, a pest named Voliacit attacks leaves and new branches, sucking their sap. The presence of white cotton-like substance on leaves indicates this pest. Notable diseases include Peacock and Canker. Spraying bicenseen can control Voliacit, while copper oxychloride and fungicyte help control diseases.\nFOR FERTILIZATION: The following fertilizers are recommended for good and regular yield:\n• First year: no fertilizer\n• Second year: 220 grams TAP, 400 grams urea, 5kg cow dung manure per plant\n• Third year: 300 grams potassium sulphate, 330 grams DAP, 600 grams urea, 10kg cow dung manure per plant\n• Fourth year: 400 grams potassium sulphate, 440 grams DAP, 800 grams urea, 15kg cow dung manure per plant\n• Fifth year: 500 grams potassium sulphate, 550 grams DAP, 1kg urea, 20kg cow dung manure per plant\n• Sixth year: 600 grams potassium sulphate, 670 grams DAP, 1.2kg urea, 25kg cow dung manure per plant\n• Seventh year: 700 grams potassium sulphate, 760 grams DAP, 1.4kg urea, 30kg cow dung manure per plant\n• Eighth year: 800 grams potassium sulphate, 860 grams TAP, 1.6kg urea, 35kg cow dung manure per plant\n• From the ninth year onwards: 1kg potassium sulphate, 1000 grams DAP, 2kg urea, 40kg cow dung manure per plant\n• The best time for applying nitrogenous fertilizer is before flowering and after fruiting.\nSOIL PREPARATION AND PLANTING:\n• Olive is an oil-bearing tree cultivated since ancient times. It can be grown in all types of soil.\n• Soil with good drainage and a pH of 5.5 to 8.5 is suitable for olive cultivation. Since olive roots do not go very deep, it can be successfully cultivated in hilly or rocky areas. It should not be cultivated in salty or semiarid soils. When planting, maintain a distance of 18 feet between rows and plants. Ensure the plant is 10 to 12 feet inside the outer boundaries of the field.\n• At least 2 months before planting, prepare the land by planting indicator crops and digging 3 by 3-foot pits. The top third of the soil removed from these pits is more fertile and should be kept separate. The less fertile soil should be kept in pit form to prevent water from flowing out during irrigation.\n• After leaving the pits open for about 2 weeks, fill them up by mixing one part of the top fertile soil with two parts of the lower soil, ensuring the filled pit is 5-6 inches above the ground level. After filling, water the pits so the fillings settle properly.\n• If the pit settles below ground level, add good quality soil to raise it, and water it again so that the pit remains level with or slightly higher than the ground. Olive trees can be planted in spring or during the monsoon months of August and September.",
    "JAWAAR\n• For irrigation information: To irrigate the crop of Jowar (sorghum), a hectare of land requires approximately 50 centimeters of water, which can be applied every 15 days after sowing. For a good crop of fodder, 2 to 3 irrigations are necessary.\n• The first irrigation should be done after 3 weeks of sowing, and subsequent irrigations should be based on the crop's water requirements. In case of a shortage of rainfall, the first irrigation should be provided early. During the grain filling stage, ensure that water stress does not occur; otherwise, it will affect the grain quality.\nFor local varieties of seeds:\n• No 1: JS 2002 is a tall, awnless variety that produces good fodder up to 700 meters above sea level and stays on the ground for an extended period.\n• No 2: Phigeri: Besides producing good fodder, this variety is also resilient to adverse conditions.\n• No 3: JS 263: This variety yields higher fodder. It is suitable for both fodder and grain production.\n• No 4: NOOR: This is a multi-purpose awnless variety that farmers can prepare themselves.\nFor harvesting information:\n• In the spring season, sorghum is cultivated in June and harvested in October and November. Sorghum should not be harvested for fodder or grain just before rainfall, as its leaves contain a poisonous substance called hydrocyanic acid, which can be harmful to animals. Harvest the crop 75 days after sowing, when about 50% of the flowers have bloomed, as the concentration of HCN decreases after flowering. After cutting, spread it in the sun and bundle it for safe storage during the winter months when fodder is scarce.\nFor pest and disease management:\n• Sorghum crops are susceptible to various pests like compulsory shoot fly, stem borer, aphids, and thrips. Additionally, diseases like red leaf spot and downy mildew affect sorghum crops with seeds. Do not use any sprays on the fodder crops. To protect against compulsory shoot fly and stem borer, apply 20 milligrams of fipronil per kilogram of seeds or 7 grams of imidacloprid before sowing the seeds. Early harvesting of the fodder crop is an effective measure against stem borers and compulsory shoot flies. For grain crops, soak them in 8 kg of water for each 8 kg of grain or for several hours before sowing, and then apply compulsory. In case of red stem disease, spray 600 ml of mancozeb per acre with 260 ml of captan or 400-500 ml of thiram. All pesticides should be used at least 3 weeks before harvesting to ensure that harmful residues do not remain. To prevent red leaf spot and downy mildew, use disease-free and healthy seeds treated with appropriate fungicides. Remove and burn leftover plants from the field after harvesting the seed crop to reduce disease spread.\n• For fertilization: Apply 2-3 tons of organic manure per hectare at least one month before sowing the crop. If cow dung is not available, use 2 bags of nitrofos per acre for fodder crops. For grain crops, use 1 bag of DAP (Diammonium Phosphate) and 1 bag of potash per acre. In irrigated areas, apply half a bag of urea mixed with water before sowing, while in rain-fed areas, apply all the fertilizers at the time of sowing.\n• Soil preparation and sowing: Adequate soil moisture is essential for sorghum cultivation. Light-colored soils can also be used for cultivation, but sandy soils are not suitable. After 3-4 days, plow and harrow the soil thoroughly to make it soft and well-tilled. Proper soil moisture is crucial for successful cultivation. For fodder crops, sow sorghum from March to August as per the water availability. However, for grain crops, July to August is the ideal time for sowing. Sowing JS 2002 sorghum in July is more beneficial. Maintain a spacing of 1 foot between rows for fodder crops, while for grain crops, the row spacing should be 1 foot. Close-row spacing affects both seedling emergence and yield. Remember, the seed depth should not exceed 3 inches, or else it will negatively impact growth.",
    "Cauliflower\n• For irrigation information, start the initial irrigation four days after sowing the Bandgobhi seeds. Afterward, provide weekly irrigation when the crop is in the vegetative stage. As the crop matures, irrigate every 10 to 14 days.\n• To protect against pests and their infestations, such as attacks by American bollworm, cabbage butterfly, armyworm, and aphids, collectively known as 'seaborn' pests, cultivate resistant varieties. When potential pest attacks are observed in the crop, seek recommendations from the agriculture department.\n• For fertilizer application to obtain a good yield, it is necessary to apply 45 kilograms of nitrogen, 25 kilograms of phosphorus, and 50 kilograms of potash per acre. During sowing, add one bag of DAP (Diammonium Phosphate), one bag of potash, and half a bag of ammonium sulfate. One month after transplanting the seedlings into the nursery, apply urea by mixing it with the soil. When the cauliflower plants start flowering, apply one bag of urea.\n• For soil preparation and successful cauliflower cultivation, select fertile soil with adequate organic matter and good water retention capacity. Approximately one month before planting, mix 15 to 20 tons of organic manure thoroughly into the soil and prepare the land for irrigation. Implement effective weed control practices. Create canals of appropriate sizes in the prepared soil.\n• For local varieties of cauliflower, consult with the agriculture department for recommended varieties.\n• For harvesting information, harvest the cauliflower crop when it reaches maturity.",
    "Aubergine/Eggplant\n• For irrigation information, transplant the seedlings to the field after 3-4 days and then provide weekly irrigation. During the winter season or when there are frequent temperature fluctuations, the irrigation frequency may need to be increased. During the early days of transplanting, use a lower amount of water and irrigation.\n• In Pakistan, there are various local varieties of eggplants, including Nirala, Bemisaal, Kesar, and Dilnasheen, suitable for different regions.\n• For harvesting information, it is recommended to harvest the fruit every three days when it is ripe. Harvesting should be done gently to avoid damaging the fruit's skin, as discolored or blemished eggplants fetch lower prices in the market. Typically, one acre of land yields around 20 to 25 tons of eggplant.\n• Pests and diseases like stem rot and fruit rot can cause significant damage to eggplant plants. Stem rot can lead to plant death. To protect against these issues, apply a recommended pesticide like Redo Mill Gold spray and use resistant varieties that have built-in defenses against these pests. Common pests that affect eggplants include aphids, red mites, whiteflies, and fruit and shoot borers. As soon as you notice any pest infestation, apply the recommended pesticide spray immediately.\n• For fertilizer application to achieve a good yield, it is essential to have well-draining soil with good water retention properties. Rotate the soil once and use organic manure three times before planting. During transplanting, add 10-12 tons of well-rotted cow dung to the soil and plow it in. At the time of transplanting, add four bags of superphosphate and one bag of ammonium nitrate to the field, and then irrigate. One month after transplanting, cultivate and add one bag of urea per acre. After 3-4 weeks, continue to apply either one bag of ammonium nitrate or half a bag of urea per acre.\n• For crop rotation, the first crop of eggplant is sown in April, and transplanting to the field begins in April. This crop yields from June to September. The second crop is sown in late June, and transplanting takes place in July and August. This season typically involves round or oblong-shaped eggplants. This crop yields from September to December. In winter, the third crop's seedlings are sown in November, and when the risk of frost subsides in February, they are transplanted to the field. For a good yield, well-draining soil with good water retention properties is crucial. Rotate the soil once and use organic manure three times before planting.",
    "Garlic\n• For irrigation information, garlic should be cultivated in well-drained soil with rows spaced about 10 cm apart, while the spacing between individual garlic bulbs can be 20 cm. It is best to cultivate garlic in dry soil and provide immediate irrigation. Afterward, perform irrigation every 3-4 days initially, and later, irrigate at intervals of 15 days as needed.\n• For local varieties of garlic, the pink-colored variety called 'Gulaabi' is preferred. This variety typically yields 3-4 tons per acre and can be stored easily for an extended period.\n• For harvesting information, garlic is usually planted in April. When the leaves turn yellow and the garlic bulbs are mature, it's time for harvesting. At this point, reduce irrigation. In the second week of April, provide a light watering. Once the leaves start to wither, use a shovel to dig up the garlic bulbs. To cure garlic, spread it out in a shaded area for 3-4 days. When the outer skin of the bulbs easily separates, trim the roots and store them in a dry and well-ventilated place.\n• Pests and diseases such as leaf-rot, rust, and thrips commonly affect garlic plants. To protect against these issues, cultivate resistant varieties and apply appropriate pesticides as soon as you observe any signs of disease or infestation.\n• For fertilizer application to achieve a good garlic yield, it is crucial to provide essential nutrients. Garlic requires 55 kg of nitrogen, 25 kg of phosphorus, and 50 kg of potassium per acre. To meet these nutrient requirements, add 2 bags of urea, 1 bag of DAP (Diammonium Phosphate), and 1 bag of potash during planting. Apply the remaining nitrogen fertilizer in December, every 15 days, as needed.\n• Garlic can be grown in various types of soil, but it thrives in well-drained, rich soil. Use 20-25 tons of organic manure per acre about a month before planting to enhance the soil's fertility. Before applying organic manure, make sure to test the soil through a soil laboratory for necessary lime and pH adjustments. After that, plow the soil once and apply gypsum to improve the soil structure and aeration. Finally, prepare the soil well with a plow or harrow.",
    "Onion\n• For irrigation information, the timing of irrigation should be adjusted according to the weather conditions. Water the onion plants with care while considering the weather conditions.\n• For local varieties of onion, Okara and Punjab are both known for producing high-yielding and attractive onions that are suitable for both seasons. Dark red onions are particularly popular for the winter season. Additionally, a new variety is being introduced for the autumn season.\n• For harvesting information, onions become ready for harvest approximately 14 to 18 weeks after transplanting, typically in April in Punjab. About two weeks before harvesting, stop watering the crop. After harvesting, leave the onions under the shade of a tree for two days, then store them in a well-ventilated place, preferably in a cool and dry location. Onions can be stored this way for up to six months. Harvest onions when the leaves and neck have dried down.\n• Pests and diseases that can affect this crop include aphids and thrips. For aphids, mix 2 grams of khad (according to the variety) in 6 liters of water, and for thrips, mix 2 grams of thiamethoxam in 6 liters of water. Onion crops can also be attacked by the white grub, a small insect that feeds on the crop's juice and causes damage. Other common pests include leafhoppers, sap-sucking insects, and neck rot.\n• For fertilizer application to achieve a good onion yield, start by adding 15-20 tons of well-rotted cow dung per acre to the soil about a month before transplanting. During soil preparation, add 4 bags of single superphosphate. Use 2 bags of ammonium sulfate and 1 bag of potassium sulfate. Alternatively, you can use 2 bags of Diammonium Phosphate (DAP), 1/2 bag of urea, and 1 bag of potassium sulfate. After two months of cultivation, apply 1 bag of urea and 2 bags of ammonium sulfate, mixed with soil, to achieve better results.\n• Soil preparation and planting are essential for onion cultivation. Well-drained, fine-textured soil with good water retention is ideal for onions. Prepare the soil by plowing it once and adding organic matter. After plowing, level the field and make ridges. Plant the onion sets on the ridges at the appropriate spacing.\nEnsure that the soil is well-prepared and friable for optimal onion cultivation.",
    "Pearl Millet\nIRRIGATION:\n    The frequency of irrigation for Bajra depends on the prevailing weather conditions.\n    Generally, four to five waterings are sufficient.\nDISEASES:\n    To protect against birds and animals, scarecrows should be set up at regular intervals.\n    Collaborate with neighboring farmers for cultivation to minimize bird damage.\nHARVESTING:\n    To check the readiness of the crop for harvesting, squeeze the grains between your fingers. If they break with an audible sound, the crop is ready for harvesting.\n    To dry the harvested stalks of Bajra, create a raised platform in the sun, about one foot above the ground, to prevent rainwater from settling. The stalks should be turned daily until they dry, after which the grains should be separated.\n    Store the dry grains in a cool and dry place to protect them from pests.\nFERTILIZERS:\n    For fertilizer application, it is recommended to apply one bag of urea and one bag of DAP (Di-Ammonium Phosphate) per acre at the time of sowing. When the crop is one to two feet tall, another bag of urea per acre can be applied.\nPLANTING:\n    It is common to use two stalks per hill for planting Bajra. The first stalk should be sown after the first irrigation, and the second stalk after the second irrigation when the soil has settled.\nLAND PREPARATION:\n    Bajra holds an important position in Pakistani agriculture, as it serves as a valuable feed for livestock and a staple food for humans.\n    In Pakistan, the average yield of Bajra is around 20 maunds (40 kilograms) per acre, whereas in some other countries, Bajra yields up to 80-100 maunds (160-200 kilograms) per acre. This means there is significant potential for increasing Bajra yields in our country.\n    By selecting suitable areas for cultivation, proper fertilizer use, and timely planting, pest control, and storage, Bajra production can be increased four to five times compared to traditional practices.\n    In areas with regular rainfall, especially during the monsoon, and with appropriate use of fertilizer and proper plant care, Bajra crops can yield up to four to five times more than traditional methods.\n    In regions near rivers, the land should be well-prepared by plowing and harrowing twice after the monsoon rains. This will ensure better soil texture and structure.\n    Cultivating Bajra in pits or ridges rather than flat planting gives better yields. The recommended spacing between rows is 7 cm (2.8 inches) for ridges and 16 cm (6.3 inches) for pits.\n    Bajra can be cultivated with either cotton drills or by hand. For drills, the seed rate is 4-6 kg per acre.\n    Thinning the crop is essential for better yield. Although thinning is not possible in the case of Bajra when planted in flat rows, it is highly recommended when the crop is planted in ridges or pits. Thinning ensures healthier plants, larger panicles, and increased yield.\n    Overcrowding with excessive planting may not result in a significant increase in yield.\n    For higher grain yields, it is recommended to plant 45,000 plants per acre and thin out extra plants.",
    "Mott Grass:\nIRRIGATION:\nFor information on irrigation, it is recommended to irrigate the crop shortly after planting, and then provide water keeping the weather conditions in mind. The frequency of watering may vary in hot weather.\nTYPES OF SEEDS:\nThere are various types of seeds available for Mott Grass cultivation, including:\n        Matt\n        Maluyaim\n        A 146\n        N 222\n        N 224\n    Maintaining a distance of three feet between plants and lines is essential to achieve a yield of approximately 5,000 culms or sprouts per acre. Reducing the spacing between plants and lines will result in fewer sprouts per plant.\n\nHARVESTING:\n\n    Information about harvesting suggests that Mott Grass is ready for cutting approximately three to four months after cultivation for fodder purposes. Afterward, it can be harvested every two to two-and-a-half months.\n    It should be cut when it reaches a height of 4 feet. In one year, you can expect a yield of 25 to 32 tons of green fodder per acre.\n\nPEST AND DISEASE RESISTANCE:\n\n    Mott Grass is endowed with natural strength and robustness, which helps it resist various diseases and attacks from pests.\n    Mott Grass is particularly resilient against most diseases and pest attacks, making it a hardy plant.\n    However, it can be susceptible to damage from cattle grazing, mainly affecting the leaves and stems.\n\nFERTILIZERS:\n\n    For fertilizer application, it is recommended to apply one bag of DAP (Di-Ammonium Phosphate) per acre at the time of land preparation. Additionally, apply one bag of Urea per acre after each cutting and provide water.\n\nLAND PREPARATION:\n\n    For land preparation and cultivation of Mott Grass, heavy clay soil is considered ideal, but it can also be grown on lighter soils as long as proper moisture management is ensured.\n    In addition to suitable soil moisture conditions, the land should be able to retain moisture as Mott Grass is a perennial plant.\n    After plowing the land and preparing it for Mott Grass cultivation, deeply plow the soil to ensure proper mixing of organic matter and conduct harrowing three to four times until the soil becomes fine and compact.\nMott Grass can be cultivated twice a year, from February to March and from July to August. It can be grown from culms and sprouts.\nPlease note that this translation is a summary of the original text and may not capture all the nuances."
]